# Pandas Pivot on Titanic Passengers csv [19 exercises with solution]

In [1]:
# importing libraries and data:

import numpy as np
import pandas as pd

titanic_data = pd.read_csv('titanic.csv')

In [2]:
# Exploring the data:

titanic_data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Unnamed: 15
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,NaN
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,NaN
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,NaN
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,NaN
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,NaN

## 19 exercises with solutions:

### 1. Write a Pandas program to print a concise summary of the dataset (titanic.csv).

### 2. Write a Pandas program to extract the column labels, shape and data types of the dataset (titanic.csv).